exclusions_orgs = [
    "שייטת גבעתי",
    "שב״כ",
    "הכי חם בגיהנום",
    "חמאס",
    "זק״א",
    "מפלסים",
    "הצלחה",
]
exclusions_place = [
    "בית אלישע",
    "בית קמה",
    "באר שבע",
    "בארי",
    "מגן",
    "ניר יצחק",
    "מפלסים",
    "מוצב ארז",
    "בית",
    "בסיס",
    "מוצב",
]
exclusions_pers = [
    "הרבי מלובביץ",
    "לילך",
    "ליאת",
    "הילה",
    "ליאם",
    "ליאורה",
    "ליאור",
    "לימור",
    "שני",
    "שי",
    "לוי אברהם",
    "שלומית",
    "שרה נתניהו",
    "שי אשר",
    "לוסי אהריש",
    "שחר",
    "שלומית",
    "לאה",
    "ליאור",
]
exclusions_dates = []
exclusions_times = []

not_org = [
    "קיבוץ",
    "R.I.P",
    "hamasisisis",
    "missiles",
    "אר פי ג׳י",
    "Revital Vitelzon Jacobs",
    "עם ישראל",
    "ניר עוז",
    "ניר יצחק",
    "אר־פי־גי",
    "ופורוש",
    "גלעד קריב",
    "universe",
    "אר־פי־ג׳י",
    "אר־פי־גי" "החמ״ל",
    "הכנסת גלעד קריב",
]
not_pers = ["אללה וואכבר", "נובה", "Nova", "ניר עוז", "איטבח אל יהוד"]
not_loc = [
    "קוב",
    "הקיבןץ",
    "קיבוץ",
    "החמ״ל",
    "לחמל",
    "חמל",
    "kibbutz",
    "שדרות ואופקים",
    "מגלן",
]
not_org = [
    "הקיבןץ",
    "קיבוץ",
    "החמ״ל",
    "ש״ג",
    "יערה",
    "המחלקה האורתופדית",
    "קוב",
    "ד״א",
    "r . i . p",
    "nova music",
    "revital vitelzon jacobs",
    "טויטה",
    "hamas captivity",
    "הכי חם בגיהנום",
    "אר פי ג׳י",
    "הכנסת גלעד קריב",
    "חמ״ל כיסופים",
    "הכי",
    "נח״ל עוז",
    "סורוקה",
    "עם ישראל",
]

specific_names = [
    "נתניהו",
    "ביבי",
    "סינוואר",
    "ירדן",
    "גלנט",
    "בנט",
    "גנץ",
    "אלון",
    "גפן",
]

is_loc = [
    "ניר עוז",
    "ניר יצחק",
    "מסיבה",
    "שדה תעופה",
    "נובה",
    "Nova",
    "מוצב ארז",
    "מסיבת הנובה",
    "מוצב נחל עוז",
    "קיבוץ רעים",
    "כרם שלום",
    "חמ״ל כיסופים",
]
is_person = ["Revital Vitelzon Jacobs", "גלעד קריב", "פורוש"]
is_org = ["מגלן", "שייטת", "גבעתי", "צוות יורם", 'החמ"ל האזרחי', "החמל האזרחי"]

special_mappings = {
    "יום שבת": "7.10.2023",
    "שבת": "7.10.2023",
    "יום שבת השחורה": "7.10.2023",
    "שמחת תורה": "7.10.2023",
    "שבת השחורה": "7.10.2023",
    "השבעה באוקטובר": "7.10.2023",
    "יום ראשון": "8.10.2023",
    "יום א": "8.10.2023",
    "יום שישי": "6.10.2023",
    "שישי": "6.10.2023",
    "Friday": "6.10.2023",
    "Saturday": "7.10.2023",
    "Sunday": "8.10.2023",
    "7 באוקטובר": "7.10.2023",  # Add this to special mappings
    "October 7": "7.10.2023",  # Add this to special mappings
}

hebrew_months = {
    "אוקטובר": "10",
    "נובמבר": "11",
    "דצמבר": "12",
    "ינואר": "1",
    "פברואר": "2",
    "מרץ": "3",
    "אפריל": "4",
    "מאי": "5",
    "יוני": "6",
    "יולי": "7",
    "אוגוסט": "8",
    "ספטמבר": "9",
}


english_months = {
    "january": "1",
    "february": "2",
    "march": "3",
    "april": "4",
    "may": "5",
    "june": "6",
    "july": "7",
    "august": "8",
    "september": "9",
    "october": "10",
    "november": "11",
    "december": "12",
}

loc_special_cases = {
    "מסיבה": "נובה",
    "מסיבת הנובה": "נובה",
    "נובה": "נובה",
    "nova": "נובה",
    "מסיבת הטבע": "נובה",
    "music festival": "נובה",
}

HEBREW_PREPOSITIONS = {
    "ב",
    "ל",
    "כ",
    "מ",
    "ש",
    "ו",
    "וה",
    "כש",
    "מה",
    "ול",
    "וש",
    "וב",
    "ול",
    "וה",
    "מה",
    "שב",
    "ומ",
}


language_mapping = {"he": "עברית", "en": "אנגלית"}
